# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

import itertools
S = int(input("Какова сумма двух чисел, которые задумал Петя? Введите: "))
P = int(input("Каково произведение двух чисел, которые задумал Петя? Введите: "))
for X, Y in itertools.product(range(S), range(P)):
    if S == X + Y and P == X * Y:
                print(X, Y)
