#Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума).

#Пример:
#Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]  
#Вывод: [1, 9, 13, 14, 19]

import random
array = [random.randint(-20, 20) for i in range(random.randint(10,20))]
print(*array)
min =int(input('Задайте минимальное значение диапазона: '))
max =int(input('Задайте максимальное значение диапазона: '))
result =[]
if max>=min:
    for i in range(len(array)):
        if max>=array[i] and min<=array[i]:
            result.append(i)

print("Индексы элементов массива:",result)