# Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X

#Пример:
#5
#1 2 3 4 5
#6
#-> 5

n = int(input('Введите количество элементов в массиве: '))
x = int(input("Введите число x: "))
A = list(range(1,n+1))
print("Элементы массива:")
print(A)

b=[abs(A[i]-x) for i in range(len(A))]
print(A[b.index(min(b))])