# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X

#Пример:
#5
#1 2 3 4 5
#3
#-> 1

n = int(input('Введите количество элементов в массиве: '))
x = int(input("Введите число x: "))
A = list(range(1,n+1))
print("Элементы массива:")
print(A)
count_x = A.count(x)
print(f"Число {x} встречается в массиве {count_x} раз.")

